dc1-leaf-03# show running-config | include feature
feature bgp
feature interface-vlan
feature vn-segment-vlan-based
feature nv overlay


dc1-leaf-01# show running-config bgp

!Command: show running-config bgp
!Running configuration last done at: Wed Mar 22 18:38:53 2023
!Time: Wed Mar 22 18:44:30 2023

version 9.3(7a) Bios:version
feature bgp

router bgp 65001
  router-id 10.0.1.1
  bestpath as-path multipath-relax
  reconnect-interval 12
  address-family ipv4 unicast
    redistribute direct route-map rd-conn
    maximum-paths 64
  address-family l2vpn evpn
  template peer spine
    remote-as 65000
    timers 3 9
    address-family ipv4 unicast
      allowas-in 3
      send-community
      send-community extended
  neighbor 10.0.1.2
    remote-as 65002
    update-source loopback1
    ebgp-multihop 3
    address-family l2vpn evpn
      send-community
      send-community extended
      route-map unchanged out
  neighbor 10.0.1.3
    remote-as 65003
    update-source loopback1
    ebgp-multihop 2
    address-family l2vpn evpn
      send-community
      send-community extended
      route-map unchanged out
  neighbor 10.2.1.0
    inherit peer spine
  neighbor 10.2.2.0
    inherit peer spine
evpn
  vni 70041 l2
    rd 10.0.1.1:32808
    route-target import auto
    route-target export auto
  vni 70043 l2
    rd 10.0.1.1:65003
    route-target import auto
    route-target export auto


dc1-leaf-01# show run int nve 1

!Command: show running-config interface nve1
!Running configuration last done at: Wed Mar 22 18:38:53 2023
!Time: Wed Mar 22 18:44:36 2023

version 9.3(7a) Bios:version

interface nve1
  no shutdown
  host-reachability protocol bgp
  source-interface loopback1
  member vni 70041
    ingress-replication protocol bgp
  member vni 70042-70043
    ingress-replication protocol bgp

dc1-leaf-01# show run vlan

!Command: show running-config vlan
!Running configuration last done at: Wed Mar 22 18:38:53 2023
!Time: Wed Mar 22 18:44:42 2023

version 9.3(7a) Bios:version
vlan 1,41,43
vlan 41
  name lf1-srv
  vn-segment 70041
vlan 43
  vn-segment 70043


dc1-leaf-01# show run interface eth 1/5

!Command: show running-config interface Ethernet1/5
!Running configuration last done at: Wed Mar 22 18:38:53 2023
!Time: Wed Mar 22 18:44:57 2023

version 9.3(7a) Bios:version

interface Ethernet1/5
  switchport access vlan 43

dc1-leaf-01# show run interface eth 1/7

!Command: show running-config interface Ethernet1/7
!Running configuration last done at: Wed Mar 22 18:38:53 2023
!Time: Wed Mar 22 18:45:00 2023

version 9.3(7a) Bios:version

interface Ethernet1/7
  description 10.4.1.3-ip-dc1-lf1-srv-01
  switchport access vlan 41
  spanning-tree port type edge