dc1-leaf-03# show running-config | include feature
feature bgp
feature interface-vlan
feature vn-segment-vlan-based
feature nv overlay


dc1-leaf-02# show running-config bgp

!Command: show running-config bgp
!Running configuration last done at: Tue Mar 21 20:43:34 2023
!Time: Wed Mar 22 18:46:44 2023

version 9.3(7a) Bios:version
feature bgp

router bgp 65002
  router-id 10.0.1.2
  bestpath as-path multipath-relax
  reconnect-interval 12
  address-family ipv4 unicast
    redistribute direct route-map rd-conn
    maximum-paths 64
  address-family l2vpn evpn
  template peer spine
    remote-as 65000
    timers 3 9
    address-family ipv4 unicast
      allowas-in 3
      send-community
      send-community extended
  neighbor 10.0.1.1
    remote-as 65001
    update-source loopback1
    ebgp-multihop 3
    address-family l2vpn evpn
      send-community
      send-community extended
      route-map UNCHANGED out
      rewrite-evpn-rt-asn
  neighbor 10.0.1.3
    remote-as 65003
    update-source loopback1
    ebgp-multihop 2
    address-family l2vpn evpn
      send-community
      send-community extended
      route-map UNCHANGED out
      rewrite-evpn-rt-asn
  neighbor 10.2.1.2
    inherit peer spine
  neighbor 10.2.2.2
    inherit peer spine
evpn
  vni 70041 l2
    rd 10.0.1.2:32808
    route-target import auto
    route-target export auto
  vni 70043 l2
    rd 10.0.1.2:65003
    route-target import auto
    route-target export auto

dc1-leaf-02# sh run int nve 1

!Command: show running-config interface nve1
!Running configuration last done at: Tue Mar 21 20:43:34 2023
!Time: Wed Mar 22 18:46:59 2023

version 9.3(7a) Bios:version

interface nve1
  no shutdown
  host-reachability protocol bgp
  source-interface loopback1
  member vni 70041
    ingress-replication protocol bgp
  member vni 70042-70043
    ingress-replication protocol bgp

dc1-leaf-02# sh run vlan

!Command: show running-config vlan
!Running configuration last done at: Tue Mar 21 20:43:34 2023
!Time: Wed Mar 22 18:47:18 2023

version 9.3(7a) Bios:version
vlan 1,41-43
vlan 41
  vn-segment 70041
vlan 42
  name lf2-srv
vlan 43
  name lf3-srv
  vn-segment 70043


dc1-leaf-02# show run int eth 1/5

!Command: show running-config interface Ethernet1/5
!Running configuration last done at: Tue Mar 21 20:43:34 2023
!Time: Wed Mar 22 18:47:34 2023

version 9.3(7a) Bios:version

interface Ethernet1/5
  switchport access vlan 43

dc1-leaf-02# show run int eth 1/7

!Command: show running-config interface Ethernet1/7
!Running configuration last done at: Tue Mar 21 20:43:34 2023
!Time: Wed Mar 22 18:47:36 2023

version 9.3(7a) Bios:version

interface Ethernet1/7
  switchport access vlan 42
  spanning-tree port type edge
